Table of Contents
Namespace IdeaRS.OpenModel
 Classes
ConnectionSetup
ConnectionSetup
OpenAttribute
Open attribute base class
OpenElementId
Open element base class POS - class can not be abstract -it causes problems with serialization
OpenModel
Open model
OpenModelContainer
OpenModelContainer is used to keep structural data and results of a finite element analysis in one place. The main reason is easier moving (passing) pass the instance of OpenModel and corresponding instace of OpenModelResults.
OpenObject
Open object base class POS - class can not be abstract -it causes problems with serialization
OriginSettings
OriginProject
ProjectData
Defines certain data about user project.
ProjectDataEc
Additional data for Ec project
ReferenceElement
Reference element class
SteelSetup
ISteelSetup
SteelSetupAISC
Steel setup IBC class
SteelSetupAUS
Steel setup IBC class
SteelSetupCISC
Steel setup IBC class
SteelSetupECEN
Steel setup ECEN class
SteelSetupHKG
Steel setup IND class
SteelSetupIND
Steel setup IND class
SteelSetupRUS
Steel setup RUS class
Tools
 Enums
ConeBreakoutCheckType
Types of cone breakout checks
CoordinateSystemMethod
A system which uses one or more numbers, or coordinates, to uniquely determine the position of a point or other geometric element.
CountryCode
CountryCode
CrossSectionConversionTable
Conversion table of cross-section
CrtCompCheckIS
CRT IS check
PreloadedBoltsLoadType
Preloaded Bolts Load Type SNIP
Symmetry
The symmetry type.
WeldEvaluation
WeldEvaluation
WeldingTypeSNIP
Welding Type